src/Catalogs/Банки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Банки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеИзменение</Name>
					<Comment>0 - ложь (соответствует классификатору); 1 - истина (соответствует классификатору, ручные правки); 2 - неопределено (введен самостоятельно)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СВИФТБИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Банки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	
КонецПроцедуры // ПриКопировании()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Страна = Справочники.СтраныМира.Россия Тогда
	
		Если НЕ ЭтоГруппа Тогда
	
			Если ЗначениеЗаполнено(КоррСчет) И СтрДлина(СокрЛП(КоррСчет)) <> 20 Тогда
				ТекстСообщения = НСтр("ru = 'Корр.счет банка должен иметь 20 знаков.'");
				ОбщегоНазначения.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					,
					,
					"КоррСчет",
					Отказ
				);			
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КоррСчет) И НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛП(КоррСчет)) Тогда
				ТекстСообщения = НСтр("ru = 'В составе Корр.счета банка должны быть только цифры.'");
				ОбщегоНазначения.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					,
					,
					"КоррСчет",
					Отказ
				);
			КонецЕсли;
			
			Если СтрДлина(СокрЛП(Код)) <> 9 Тогда
				ТекстСообщения = НСтр("ru = 'БИК банка должен иметь 9 знаков.'");
				ОбщегоНазначения.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					,
					,
					"Код",
					Отказ
				);
			КонецЕсли;

			Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛП(Код)) Тогда
				ТекстСообщения = НСтр("ru = 'В составе БИК банка должны быть только цифры.'");
				ОбщегоНазначения.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					,
					,
					"Код",
					Отказ
				);
			КонецЕсли;
		
		КонецЕсли;
		
	Иначе
		
		СтоматологияСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Код");
		
	КонецЕсли;
	
	ТекстСообщения = "";
	Если Не SWIFTКорректен(СокрЛП(СВИФТБИК), ТекстСообщения) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			"СВИФТБИК",
			Отказ
		);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет корректность номера SWIFT банка
//
// Параметры:
//  СВИФТБИК          - Строка - номер SWIFT  проверяемого банка
//  ТекстСообщения - Строка - в параметр передается текст сообщения об ошибке, если проверка не пройдена.
// 
// Возвращаемое значение:
//  Булево - Результат проверки SWIFT, если Ложь, тогда SWIFT некорректный
//
Функция SWIFTКорректен(СВИФТБИК, ТекстСообщения)
	
	Если ПустаяСтрока(СВИФТБИК) Тогда
		Возврат Истина;
	КонецЕсли;
	
	SWIFTКорректен = Ложь;
	ТекстСообщения = "";
	Если Не ОбщегоНазначенияСлужебныйКлиентСервер.ПроверитьДлинуSWIFT(СВИФТБИК) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'SWIFT должен состоять из 8 или 11 символов'");
	ИначеЕсли Не ОбщегоНазначенияСлужебныйКлиентСервер.ПроверитьРазрешенныеСимволыSWIFT(СВИФТБИК) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Разрешены только буквы от A до Z и цифры'");
	Иначе
		SWIFTКорректен = Истина;
	КонецЕсли;
	
	Возврат SWIFTКорректен;
	
КонецФункции

#КонецОбласти

#КонецЕсли
